{
  "/ Sahifa": "/ Sahifa",
  "67 Marsh Wall, Harcourt Tower. E14 9GS (Visits by appointment only)": "67 Marsh Wall, Harcourt Tower. E14 9GS (Faqat oldindan uchrashuv orqali tashrif buyurish)",
  "A dedicated team united by one goal — helping people and businesses grow together": "Bir maqsad bilan birlashgan sadoqatli jamoa — odamlar va biznesning birgalikda rivojlanishiga yordam berish",
  "ABOUT OUR COMPANY": "KOMPANIYAMIZ HAQIDA",
  "About us": "Biz haqimizda",
  "Apply for a job": "Ishga ariza berish",
  "Aprel": "Aprel",
  "Are you eligible to work in the UK?": "Buyuk Britaniyada ishlash huquqiga egamisiz?",
  "At the heart of our mission lies a simple but powerful belief: meaningful work can change lives, and the right people can transform businesses. We are committed to creating a space where individuals feel empowered to discover opportunities that align with their skills, passions, and goals — while also enabling companies to find talent that drives real progress.": "Missiyamizning markazida oddiy, ammo kuchli ishonch yotadi: mazmunli ish hayotni o'zgartirishi mumkin, to'g'ri odamlar esa biznesni tubdan o'zgartirishi mumkin. Biz odamlarga o'z ko'nikmalari, ishtiyoqlari va maqsadlari bilan mos keladigan imkoniyatlarni kashf qilishda o'zlarini kuchli his qiladigan muhit yaratishga va kompaniyalarga haqiqiy yutuqlarga olib keladigan iste'dodlarni topishga yordam berishga sodiqmiz.",
  "Available roles updated weekly — from general labour to hospitality and skilled trades.": "Mavjud rollar har hafta yangilanadi - umumiy mehnatdan mehmondo'stlik va malakali kasblargacha.",
  "Avgust": "Avgust",
  "Back to home": "Asosiy sahifaga qaytish",
  "Business Growth": "Biznes rivojlanishi",
  "Can businesses find workers here?": "Bu yerda kompaniyalar xodim topa oladimi?",
  "Can I upload my resume?": "Rezyumemni yuklay olamanmi?",
  "Cancel": "Bekor qilish",
  "Candidates from London and beyond — actively applying": "London va undan tashqaridagi nomzodlar - faol ariza berishadi",
  "Cho": "Chor",
  "Chor": "Chor",
  "Chorshanba": "Chorshanba",
  "Close": "Yopish",
  "Contact Center 24/7": "Aloqa markazi 24/7",
  "Contacts": "Aloqalar",
  "Dekabr": "Dekabr",
  "Du": "Dush",
  "Dush": "Dush",
  "Dushanba": "Dushanba",
  "Email": "Elektron pochta",
  "Fast Hiring": "Tez yollash",
  "Fevral": "Fevral",
  "Fill out the form, and our specialist will contact you for a detailed consultation": "Formani to'ldiring, mutaxassisimiz siz bilan batafs ularning xohishi bilan bog'lanadi.",
  "Find talent": "Iste'dod topish",
  "First and last name": "Ism va familiya",
  "Flexible solutions that fit your company’s hiring needs": "Kompaniyangizning yollash ehtiyojlariga mos keladigan moslashuvchan yechimlar",
  "Frequently Asked Questions": "Tez-tez so'raladigan savollar",
  "Fresh roles available weekly across multiple industries": "Har hafta turli sohalarda yangi rollar mavjud",
  "Give us a few information": "Bizga bir oz ma'lumot bering",
  "Got a Question? We've Got You.": "Savolingiz bormi? Biz yordam beramiz.",
  "Have questions or need assistance finding the right job? We’re here to support you every step of the way.": "Savollaringiz bormi yoki to'g'ri ish topishda yordam kerakmi? Biz har qadamda sizni qo'llab-quvvatlaymiz.",
  "Hire with Us": "Biz bilan yollang",
  "Hiring the right people can make or break a business — and we’re here to make sure you get it right. We go beyond simply collecting resumes. Our team works closely with employers to understand their specific needs and company culture. We then match the with carefully vetted, skilled, and motivated candidates who are ready to contribute from day one.": "To'g'ri odamlarni yollash biznesni muvaffaqiyatli yoki muvaffaqiyatsiz qilishi mumkin — biz buni to'g'ri amalga oshirish uchun shu yerdamiz. Biz shunchaki rezyume yig'ishdan tashqariga chiqamiz. Jamoamiz ish beruvchilar bilan ularning o'ziga xos ehtiyojlari va kompaniya madaniyatini tushunish uchun yaqindan ishlaydi. Keyin biz ularga birinchi kundan boshlab hissa qo'shishga tayyor bo'lgan sinchkovlik bilan tekshirilgan, malakali va motivatsiyalangan nomzodlarni moslashtiramiz.",
  "How can I apply for a job?": "Ishga qanday ariza berishim mumkin?",
  "In a world where finding the right talent or the right job can feel overwhelming, we step in as a trusted partner to make the journey easier, faster, and more human. Our approach is built on real understanding — of industries, of people, and of potential.": "To'g'ri iste'dod yoki to'g'ri ish topish juda qiyin bo'lib tuyuladigan dunyoda, biz ishonchli hamkor sifatida yo'lni osonlashtirish, tezlashtirish va insoniyroq qilish uchun qadam qo'yamiz. Bizning yondashuvimiz soha, odamlar va potentsialni haqiqiy tushunishga asoslangan.",
  "Is it free to use this service?": "Bu xizmatdan foydalanish bepulmi?",
  "Is my personal data secure?": "Shaxsiy ma'lumotlarim xavfsizmi?",
  "It’s easy! Just click “Apply for a job”, fill out the form, and tell us what kind of work you’re looking for. We’ll contact you soon with matching opportunities.": "Bu oson! Faqat “Ishga ariza berish” tugmasini bosing, formani to'ldiring va qanday ish qidirayotganingizni bizga ayting. Tez orada sizga mos keladigan imkoniyatlar bilan bog'lanamiz.",
  "Iyul": "Iyul",
  "Iyun": "Iyun",
  "Job application": "Ish uchun ariza",
  "Job seekers celebrate finding the right role, while employers rejoice in discovering skilled professionals. It’s all about mutual success and satisfaction.": "Ish izlovchilar o'zlariga mos rol topganidan xursand bo'lishadi, ish beruvchilar esa malakali mutaxassislarni topganidan xursand bo'lishadi. Hammasi o'zaro muvaffaqiyat va qoniqish haqida.",
  "Jobs in construction, hotels, events, logistics, and more": "Qurilish, mehmonxonalar, tadbirlar, logistika va boshqalardagi ishlar",
  "Ju": "Jum",
  "Jum": "Jum",
  "Juma": "Juma",
  "Let us be your trusted hiring partner.": "Biz sizning ishonchli yollash hamkoringiz bo'laylik.",
  "Let’s talk": "Keling, gaplashaylik",
  "Loading...": "Yuklanmoqda...",
  "Looking for Great Employees? Let’s Work Together": "Ajoyib xodimlar qidiryapsizmi? Keling, birgalikda ishlaylik",
  "Main page": "Asosiy sahifa",
  "Mart": "Mart",
  "May": "May",
  "Messages": "Xabarlar",
  "Mon - Sat | 9:00 AM - 6:00 PM": "Dushanba - Shanba | 9:00 - 18:00",
  "Next": "Keyingi",
  "No, I am not": "Yo'q, men emasman",
  "Noyabr": "Noyabr",
  "Oktabr": "Oktabr",
  "Open vacancy": "Ochik vakansiya",
  "Open vacansy": "Ochik vakansiya",
  "Our Address": "Bizning manzil",
  "Our administrator will contact you within 24 hours. Thank you for your interest and for submitting your application!": "Administratorimiz 24 soat ichida siz bilan bog'lanadi. Qiziqishingiz va arizangizni topshirganingiz uchun rahmat!",
  "Our goal is to remove the barriers that often slow down or complicate hiring. We believe in making the process human-centered, efficient, and effective. Whether you're a job seeker aiming to grow your career or a business looking to scale with the right team — we're here to connect you in ways that matter.": "Maqsadimiz yollash jarayonini sekinlashtiradigan yoki murakkablashtiradigan to'siqlarni olib tashlashdir. Biz jarayonni insonparvar, samarali va samarador qilishga ishonamiz. Siz karyerangizni rivojlantirishni maqsad qilgan ish izlovchi bo'lasizmi yoki to'g'ri jamoa bilan kengaymoqchi bo'lgan biznes bo'lasizmi — biz sizni muhim tarzda bog'lash uchun shu yerdamiz.",
  "Our job is simple: to help businesses stay fully staffed, compliant, and productive — whether it’s a one-day shift or a long-term team. And for workers, we offer legal job opportunities, and a clear path to career growth.": "Bizning vazifamiz oddiy: bizneslarga to'liq xodim bilan ta'minlash, qonuniy rioya qilish va samarali bo'lishda yordam berish — bu bir kunlik smena bo'ladimi yoki uzoq muddatli jamoa bo'ladimi. Ishchilar uchun esa qonuniy ish imkoniyatlari va karyera o'sishi uchun aniq yo'l taklif qilamiz.",
  "Our mission": "Bizning missiyamiz",
  "Our system intelligently connects the right talent with the right opportunity.": "Bizning tizimimiz to'g'ri iste'dodni to'g'ri imkoniyat bilan aqlli ravishda bog'laydi.",
  "Pa": "Pay",
  "Partner companies": "Hamkor kompaniyalar",
  "Pay": "Pay",
  "Payshanba": "Payshanba",
  "People-Centered": "Odamlar markazida",
  "Phone number": "Telefon raqami",
  "Please fill in all fields": "Iltimos, barcha maydonlarni to'ldiring",
  "Please fill out all fields": "Iltimos, barcha maydonlarni to'ldiring",
  "Please select your position": "Iltimos, lavozimingizni tanlang",
  "Prev": "Oldingi",
  "Professional Workforce Resources provides flexible and reliable staffing solutions for companies across the UK.": "Professional Workforce Resources Buyuk Britaniyadagi kompaniyalar uchun moslashuvchan va ishonchli xodim ta'minoti yechimlarini taqdim etadi.",
  "Qualified Candidates": "Malakali nomzodlar",
  "Regional attendees": "Hududiy ishtirokchilar",
  "Se": "Sesh",
  "See all Vacancy": "Barcha vakansiyalarni ko'rish",
  "Select your position": "Lavozimingizni tanlang",
  "Send": "Yuborish",
  "Sentabr": "Sentabr",
  "Sesh": "Sesh",
  "Seshanba": "Seshanba",
  "Sha": "Shan",
  "Shan": "Shan",
  "Shanba": "Shanba",
  "Smart Matching": "Aqlli moslashtirish",
  "Smart Partnerships": "Aqlli hamkorlik",
  "Speed up your recruitment process with ease": "Yollash jarayonini osonlik bilan tezlashtiring",
  "Submit an Application": "Ariza topshirish",
  "Success": "Muvaffaqiyat",
  "Tilni tanlang": "Tilni tanlang",
  "Trusted by hotels, construction firms, logistics operators & event organisers across the UK.": "Buyuk Britaniyadagi mehmonxonalar, qurilish firmalari, logistika operatorlari va tadbir tashkilotchilari tomonidan ishonchli.",
  "Upload your resume": "Rezyumeni yuklang",
  "Vacansies": "Vakansiyalar",
  "We are not just a company that helps people find jobs — we are a catalyst for transformation.": "Biz shunchaki odamlarga ish topishda yordam beradigan kompaniya emasmiz — biz o'zgarishlar uchun katalizatormiz.",
  "We are on social media": "Biz ijtimoiy tarmoqlardamiz",
  "We believe that behind every successful business is the right team, and behind every thriving career is the right opportunity. That’s why we focus on creating meaningful connections — not just filling positions. Every profile, every resume, and every vacancy is a chance to create something greater.": "Biz har bir muvaffaqiyatli biznes ortida to'g'ri jamoa, har bir gullab-yashnayotgan karyera ortida esa to'g'ri imkoniyat borligiga ishonamiz. Shuning uchun biz shunchaki lavozimlarni to'ldirishga emas, mazmunli aloqalar yaratishga e'tibor qaratamiz. Har bir profil, har bir rezyume va har bir vakansiya katta narsa yaratish imkoniyatidir.",
  "We believe the right people can change everything — that’s why we don’t just close vacancies.": "Biz to'g'ri odamlar hamma narsani o'zgartirishi mumkinligiga ishonamiz — shuning uchun biz shunchaki vakansiyalarni yopmaymiz.",
  "We collaborate with leading businesses across industries — from tech to construction — who believe in innovation, quality, and growth. These partnerships drive our mission forward and create real impact.": "Biz texnologiyadan tortib qurilishgacha bo'lgan sohalardagi yetakchi bizneslar bilan hamkorlik qilamiz, ular innovatsiya, sifat va o'sishga ishonadilar. Bu hamkorliklar bizning missiyamizni oldinga siljitadi va haqiqiy ta'sir yaratadi.",
  "We focus on building real human connections between job seekers and employers.": "Biz ish izlovchilar va ish beruvchilar o'rtasida haqiqiy insoniy aloqalarni qurishga e'tibor qaratamiz.",
  "We have talented candidates ready to join your team. Post your job with us and reach the right people faster. It’s simple, smart, and effective.": "Bizda sizning jamoangizga qo'shilishga tayyor iste'dodli nomzodlar bor. Ish e'loningizni bizda joylashtiring va to'g'ri odamlarga tezroq erishing. Bu oddiy, aqlli va samarali.",
  "We help build the teams behind great projects, smooth operations, and successful businesses.": "Biz ajoyib loyihalar, silliq operatsiyalar va muvaffaqiyatli bizneslar ortidagi jamoalarni qurishda yordam beramiz.",
  "We help companies grow by simplifying recruitment and reducing hiring time.": "Biz yollashni soddalashtirish va yollash vaqtini qisqartirish orqali kompaniyalarning rivojlanishiga yordam beramiz.",
  "We offer jobs in construction, hotels, cleaning, events, and logistics.You can find both full-time and part-time roles, like general labourers, waiters, kitchen porters, and more.": "Biz qurilish, mehmonxonalar, tozalash, tadbirlar va logistika sohasida ish taklif qilamiz. Siz to'liq va yarim kunlik rollarni topishingiz mumkin, masalan, umumiy ishchilar, ofitsiantlar, oshxona xodimlari va boshqalar.",
  "We supply trained and vetted workers for construction sites, hotels, warehouses, events, and cleaning contracts — exactly when and where they’re needed.": "Biz qurilish maydonchalari, mehmonxonalar, omborlar, tadbirlar va tozalash shartnomalari uchun o'qitilgan va tekshirilgan ishchilarni ta'minlaymiz — aynan qachon va qayerda kerak bo'lsa.",
  "What kind of jobs can I find here?": "Bu yerda qanday ishlarni topishim mumkin?",
  "Whether you’re a startup looking to scale quickly or an established business in search of top-tier talent, our personalized and streamlined recruitment process helps you save time, reduce hiring costs, and find the right people faster. We don’t just fill positions — we help build strong teams that drive success.": "Siz tez kengaymoqchi bo'lgan startap bo'lasizmi yoki yuqori darajadagi iste'dodlarni qidirayotgan tashkil topgan biznes bo'lasizmi, bizning shaxsiylashtirilgan va soddalashtirilgan yollash jarayonimiz vaqtni tejash, yollash xarajatlarini kamaytirish va to'g'ri odamlarni tezroq topishga yordam beradi. Biz shunchaki lavozimlarni to'ldirmaymiz — biz muvaffaqiyatga olib keladigan kuchli jamoalarni qurishga yordam beramiz.",
  "Whether you’re an individual chasing your next big step or a business searching for your next key player — we’re here to help you grow, succeed, and move forward.": "Siz keyingi katta qadamni qidirayotgan shaxs bo'lasizmi yoki keyingi asosiy o'yinchini qidirayotgan biznes bo'lasizmi — biz sizning o'sishingiz, muvaffaqiyat qozonishingiz va oldinga siljishingiz uchun shu yerdamiz.",
  "Why Choose Us?": "Nega bizni tanlaysiz?",
  "With modern technology, deep market insight, and a human-centered philosophy, we bring together job seekers and employers in a way that creates real value.": "Zamonaviy texnologiyalar, chuqur bozor tushunchasi va insonparvar falsafa bilan biz ish izlovchilar va ish beruvchilarni haqiqiy qiymat yaratadigan tarzda birlashtiramiz.",
  "Work by professions": "Kasblar bo'yicha ish",
  "Working Hours:": "Ish soatlari:",
  "Ya": "Yak",
  "Yak": "Yak",
  "Yakshanba": "Yakshanba",
  "Yanvar": "Yanvar",
  "Yes — applying for a job through our website is 100% free. We work directly with employers, so you don’t pay anything.": "Ha — veb-saytimiz orqali ishga ariza berish 100% bepul. Biz to'g'ridan-to'g'ri ish beruvchilar bilan ishlaymiz, shuning uchun siz hech narsa to'lamaysiz.",
  "Yes, I am": "Ha, men",
  "Yes, Just send us an email at info@thepwragency.co.uk or call +44 020 3370 6657 and let us know what kind of workers you need. We’ll quickly match you with reliable, verified candidates.": "Ha, faqat info@thepwragency.co.uk manziliga elektron pochta yuboring yoki +44 020 3370 6657 raqamiga qo'ng'iroq qiling va qanday xodimlar kerakligini bizga ayting. Biz sizni tezda ishonchli, tekshirilgan nomzodlar bilan moslashtiramiz.",
  "Yes, your information is safe. Our company is registered with the ICO and follows all data protection rules (UK GDPR). We only use your data to help you get the right job.": "Ha, ma'lumotlaringiz xavfsiz. Kompaniyamiz ICOda ro'yxatdan o'tgan va barcha ma'lumotlarni himoya qilish qoidalariga (UK GDPR) rioya qiladi. Biz sizning ma'lumotlaringizni faqat to'g'ri ish topishda yordam berish uchun ishlatamiz.",
  "Yes! You can upload your CV directly on our website when you apply. No CV? No problem — just tell us your experience in the form and we’ll help from there.": "Ha! Ariza topshirishda veb-saytimizga rezyumeni to'g'ridan-to'g'ri yuklashingiz mumkin. Rezyume yo'qmi? Muammo emas — formaga tajribangizni yozing, biz shundan keyin yordam beramiz.",
  "You get access to ready-to-hire professionals": "Siz yollashga tayyor professionalarga kirish huquqiga ega bo'lasiz",
  "Your application has been sent.": "Arizangiz yuborildi.",
  "Your application has been successfully submitted!": "Arizangiz muvaffaqiyatli topshirildi!",
  "Your email": "Sizning elektron pochtangiz"
}
